#  Task 2 - Data Science - Prodigy InfoTech - Internship 

### Data set used : https://www.kaggle.com/competitions/titanic/data

# The Task is to " CLEAN DATA AND EDA " .

Diving into the data it turns out in the file "Gender Submission" the data Starts with the passenger number 892. Andd, there is no other innformation in gender_submission but, if you look into titanic2 file, the data starts with passenger 892 not having the survival column.

So, im going to merge both of them:

In [22]:
import pandas as pd
import numpy as np 

gender_sub = pd.read_csv('gender_submission.csv')
titanic2 = pd.read_csv('titanic2.csv')
survived_for_titanic2 = gender_sub['Survived']
titanic2.insert(1, 'Survived' , survived_for_titanic2)
titanic2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

# Successfully merged the gender_submission's survived column in titanic2.
## now we need to actually make one dataframe that has all of the passsengers and their data accordingly for optimization. 

here we are going to do it :

In [20]:
titanic3 = pd.read_csv('titanic3.csv')
titanic3.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
titanic_new= titanic3.append(titanic2, ignore_index=True)
titanic3

AttributeError: 'DataFrame' object has no attribute 'append'